branch = (("0", "Κεντρικό"),)

series = (("0",), ("A",))

fpa = (
    ("1", "ΦΠΑ 24%"),
    ("2", "ΦΠΑ 13%"),
    ("3", "ΦΠΑ 6%"),
    ("4", "ΦΠΑ 17%"),
    ("5", "ΦΠΑ 9%"),
    ("6", "ΦΠΑ 4%"),
    ("7", "ΦΠΑ 0%"),
    ("8", "Xωρίς ΦΠΑ"),  # π.χ. Μισθοδοσία, αποσβέσεις κλπ
)

icat = (
    ("category1_1", "Έσοδα από Πώληση Εμπορευμάτων"),
    ("category1_2", "Έσοδα από Πώληση Προϊόντων"),
    ("category1_3", "Έσοδα από Παροχή Υπηρεσιών"),
    ("category1_4", "Έσοδα από Πώληση Παγίων"),
    ("category1_5", "Λοιπά Έσοδα/Κέρδη"),
    ("category1_6", "Αυτοπαραδόσεις/Ιδιοχρησιμοποιήσεις"),
    ("category1_7", "Έσοδα για λ/σμο τρίτων"),
    ("category1_8", "Έσοδα προηγούμενων χρήσεων"),
    ("category1_9", "Έσοδα επομένων χρήσεων"),
    ("category1_10", "Λοιπές Εγγραφές Τακτοποίησης Εσόδων"),
    ("category1_95", "Λοιπά Πληροφοριακά Στοιχεία Εσόδων"),
)

ie3 = (
    ("E3_561_001", "Πωλήσεις αγαθών και υπηρεσιών Χονδρικές - Επιτηδευματιών"),
    (
        "E3_561_002",
        "Πωλήσεις αγαθών και υπηρεσιών Χονδρικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)",
    ),
    ("E3_561_003", "Πωλήσεις αγαθών και υπηρεσιών Λιανικές - Ιδιωτική Πελατεία"),
    (
        "E3_561_004",
        "Πωλήσεις αγαθών και υπηρεσιών Λιανικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)",
    ),
    ("E3_561_005", "Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Ενδοκοινοτικές"),
    ("E3_561_006", "Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Τρίτες Χώρες"),
    ("E3_561_007", "Πωλήσεις αγαθών και υπηρεσιών Λοιπά"),
    ("E3_562", "Λοιπά συνήθη έσοδα"),
    ("E3_563", "Πιστωτικοί τόκοι και συναφή έσοδα"),
    ("E3_564", "Πιστωτικές συναλλαγματικές διαφορές"),
    ("E3_565", "Έσοδα συμμετοχών"),
    ("E3_566", "Κέρδη από διάθεση μη κυκλοφορούντων περιουσιακών στοιχείων"),
    ("E3_567", "Κέρδη από αναστροφή προβλέψεων και απομειώσεων"),
    ("E3_568", "Κέρδη από επιμέτρηση στην εύλογη αξία"),
    ("E3_570", "Ασυνήθη έσοδα και κέρδη"),
    ("E3_595", "Έξοδα σε ιδιοπαραγωγή"),
    ("E3_596", "Επιδοτήσεις - Επιχορηγήσεις"),
    ("E3_597", "Επιδοτήσεις - Επιχορηγήσεις για επενδυτικούς σκοπούς - κάλυψη δαπανών"),
    ("E3_880_001", "Πωλήσεις Παγίων Χονδρικές"),
    ("E3_880_002", "Πωλήσεις Παγίων Λιανικές"),
    ("E3_880_003", "Πωλήσεις Παγίων Εξωτερικού Ενδοκοινοτικές"),
    ("E3_880_004", "Πωλήσεις Παγίων Εξωτερικού Τρίτες Χώρες"),
    ("E3_881_001", "Πωλήσεις για λογ/σμο Τρίτων Χονδρικές"),
    ("E3_881_002", "Πωλήσεις για λογ/σμο Τρίτων Λιανικές"),
    ("E3_881_003", "Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Ενδοκοινοτικές"),
    ("E3_881_004", "Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Τρίτες Χώρες"),
    (
        "E3_106",
        "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Εμπορεύματα",
    ),
    (
        "E3_205",
        "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά",
    ),
    (
        "E3_210",
        "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη",
    ),
    (
        "E3_305",
        "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις – Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά",
    ),
    (
        "E3_310",
        "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη",
    ),
    (
        "E3_318",
        "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Έξοδα παραγωγής",
    ),
)

itype = (
    ("1.1", "Τιμολόγιο Πώλησης"),
    ("1.2", "Τιμολόγιο Πώλήσης / Ενδοκοινοτικές Παραδόσεις"),
    ("1.3", "Τιμολόγιο Πώλησης / Παραδόσεις Τρίτων Χωρών"),
    ("1.4", "Τιμολόγιο Πώλησης / Πώληση για Λογαριασμό Τρίτων"),
    (
        "1.5",
        "Τιμολόγιο Πώλησης / Εκκαθάριση Πωλήσεων Τρίτων - Αμοιβή από Πωλήσεις Τρίτων",
    ),
    ("1.6", "Τιμολόγιο Πώλησης / Συμπληρωματικό Παραστατικό"),
    ("2.1", "Τιμολόγιο Παροχής"),
    ("2.2", "Τιμολόγιο Παροχής / Ενδοκοινοτική Παροχή Υπηρεσιών"),
    ("2.3", "Τιμολόγιο Παροχής / Παροχή Υπηρεσιών σε λήπτη Τρίτης Χώρας"),
    ("2.4", "Τιμολόγιο Παροχής / Συμπληρωματικό Παραστατικό"),
    ("3.1", "Τίτλος Κτήσης (μη υπόχρεος Εκδότης)"),
    ("3.2", "Τίτλος Κτήσης (άρνηση έκδοσης από υπόχρεο Εκδότη)"),
    ("5.1", "Πιστωτικό Τιμολόγιο / Συσχετιζόμενο"),
    ("5.2", "Πιστωτικό Τιμολόγιο / Μη Συσχετιζόμενο"),
    ("6.1", "Στοιχείο Αυτοπαράδοσης"),
    ("6.2", "Στοιχείο Ιδιοχρησιμοποίησης"),
    ("7.1", "Συμβόλαιο - Έσοδο"),
    ("8.1", "Ενοίκια - Έσοδο"),
    ("8.2", "Ειδικό Στοιχείο – Απόδειξης Είσπραξης Φόρου Διαμονής"),
    ("11.1", "ΑΛΠ"),
    ("11.2", "ΑΠΥ"),
    ("11.3", "Απλοποιημένο Τιμολόγιο"),
    ("11.4", "Πιστωτικό Στοιχ. Λιανικής"),
    ("11.5", "Απόδειξη Λιανικής Πώλησης για Λογ/σμό Τρίτων"),
    ("13.1", "Έξοδα - Αγορές Λιανικών Συναλλαγών ημεδαπής / αλλοδαπής"),
    ("13.2", "Παροχή Λιανικών Συναλλαγών ημεδαπής / αλλοδαπής"),
    ("13.3", "Κοινόχρηστα"),
    ("13.4", "Συνδρομές"),
    ("13.30", "Παραστατικά Οντότητας ως Αναγράφονται από την ίδια (Δυναμικό)"),
    ("13.31", "Πιστωτικό Στοιχ. Λιανικής ημεδαπής / αλλοδαπής"),
    ("14.1", "Τιμολόγιο / Ενδοκοινοτικές Αποκτήσεις"),
    ("14.2", "Τιμολόγιο / Αποκτήσεις Τρίτων Χωρών"),
    ("14.3", "Τιμολόγιο / Ενδοκοινοτική Λήψη Υπηρεσιών"),
    ("14.4", "Τιμολόγιο / Λήψη Υπηρεσιών Τρίτων Χωρών"),
    ("14.5", "ΕΦΚΑ και λοιποί Ασφαλιστικοί Οργανισμοί"),
    ("14.30", "Παραστατικά Οντότητας ως Αναγράφονται από την ίδια (Δυναμικό)"),
    ("14.31", "Πιστωτικό ημεδαπής / αλλοδαπής"),
    ("15.1", "Συμβόλαιο - Έξοδο"),
    ("16.1", "Ενοίκιο Έξοδο"),
    ("17.1", "Μισθοδοσία"),
    ("17.2", "Αποσβέσεις"),
    ("17.3", "Λοιπές Εγγραφές Τακτοποίησης Εσόδων - Λογιστική Βάση"),
    ("17.4", "Λοιπές Εγγραφές Τακτοποίησης Εσόδων - Φορολογική Βάση"),
    ("17.5", "Λοιπές Εγγραφές Τακτοποίησης Εξόδων - Λογιστική Βάση"),
    ("17.6", "Λοιπές Εγγραφές Τακτοποίησης Εξόδων - Φορολογική Βάση"),
)


typ_cat_e3 = (
    ### Τιμολόγιο Πώλησης ##############
    ## Εσωτερικού
    #       Έσοδα από Πώληση Εμπορευμάτων
    ("1.1", "category1_1", "E3_561_001"),
    ("1.1", "category1_1", "E3_561_002"),
    ("1.1", "category1_1", "E3_561_007"),
    #       Έσοδα από Πώληση Προϊόντων
    ("1.1", "category1_2", "E3_561_001"),
    ("1.1", "category1_2", "E3_561_002"),
    ("1.1", "category1_2", "E3_561_007"),
    #       Έσοδα από Παροχή Υπηρεσιών
    ("1.1", "category1_3", "E3_561_001"),
    ("1.1", "category1_3", "E3_561_002"),
    ("1.1", "category1_3", "E3_561_007"),
    ("1.1", "category1_3", "E3_563"),
    #       Έσοδα από Πώληση Παγίων
    ("1.1", "category1_4", "E3_880_001"),
    #       Λοιπά Έσοδα/Κέρδη
    ("1.1", "category1_5", "E3_561_007"),
    ("1.1", "category1_5", "E3_562"),
    ("1.1", "category1_5", "E3_563"),
    ("1.1", "category1_5", "E3_564"),
    ("1.1", "category1_5", "E3_565"),
    ("1.1", "category1_5", "E3_566"),
    ("1.1", "category1_5", "E3_567"),
    ("1.1", "category1_5", "E3_568"),
    ("1.1", "category1_5", "E3_570"),
    ("1.1", "category1_5", "E3_561_002"),
    #       Έσοδα για λ/σμο τρίτων
    ("1.1", "category1_7", "E3_881_001"),
    ("1.1", "category1_7", "E3_881_003"),
    ("1.1", "category1_7", "E3_881_004"),
    #       Λοιπά Πληροφοριακά Στοιχεία Εσόδων
    ("1.1", "category1_95", "E3_596"),
    ("1.1", "category1_95", "E3_597"),
    # ("1.1", "category1_95", ""),
    ## Ενδοκοινοτικές παραδόσεις
    ("1.2", "category1_1", "E3_561_005"),
    ("1.2", "category1_1", "E3_561_007"),
    #
    ("1.2", "category1_2", "E3_561_005"),
    ("1.2", "category1_2", "E3_561_007"),
    #
    ("1.2", "category1_3", "E3_561_005"),
    ("1.2", "category1_3", "E3_561_007"),
    #
    ("1.2", "category1_4", "E3_880_003"),
    #
    ("1.2", "category1_5", "E3_561_005"),
    ("1.2", "category1_5", "E3_561_007"),
    ("1.2", "category1_5", "E3_562"),
    ("1.2", "category1_5", "E3_570"),
    #
    ("1.2", "category1_7", "E3_881_004"),
    ## Παραδόσεις Τρίτων Χωρών
    ("1.3", "category1_1", "E3_561_006"),
    ("1.3", "category1_1", "E3_561_007"),
    #
    ("1.3", "category1_2", "E3_561_006"),
    ("1.3", "category1_2", "E3_561_007"),
    #
    ("1.3", "category1_3", "E3_561_006"),
    ("1.3", "category1_3", "E3_561_007"),
    #
    ("1.3", "category1_4", "E3_880_004"),
    #
    ("1.3", "category1_5", "E3_561_006"),
    ("1.3", "category1_5", "E3_561_007"),
    ("1.3", "category1_5", "E3_562"),
    ("1.3", "category1_5", "E3_570"),
    #
    ("1.3", "category1_7", "E3_881_004"),
    ## Για λογαριασμό τρίτων
    ("1.4", "category1_7", "E3_881_001"),
    ("1.4", "category1_7", "E3_881_003"),
    ("1.4", "category1_7", "E3_881_004"),
    ## Εκκαθάριση πωλήσεων τρίτων
    ("1.5", "category1_3", "E3_561_001"),
    ("1.5", "category1_3", "E3_561_007"),
    ### Τιμολόγιο Παροχής ##############
    ## Εσωτερικού
    ("2.1", "category1_3", "E3_561_001"),
    ("2.1", "category1_3", "E3_561_002"),
    ("2.1", "category1_3", "E3_561_007"),
    ("2.1", "category1_3", "E3_563"),
    #
    ("2.1", "category1_5", "E3_561_007"),
    ("2.1", "category1_5", "E3_562"),
    ("2.1", "category1_5", "E3_563"),
    ("2.1", "category1_5", "E3_564"),
    ("2.1", "category1_5", "E3_565"),
    ("2.1", "category1_5", "E3_566"),
    ("2.1", "category1_5", "E3_567"),
    ("2.1", "category1_5", "E3_568"),
    ("2.1", "category1_5", "E3_570"),
    ## Ενδοκοινοτιή παροχή υπηρεσιών
    ("2.2", "category1_3", "E3_561_005"),
    ("2.2", "category1_3", "E3_561_007"),
    ("2.2", "category1_3", "E3_563"),
    #
    ("2.2", "category1_5", "E3_561_005"),
    ("2.2", "category1_5", "E3_561_007"),
    ("2.2", "category1_5", "E3_562"),
    ("2.2", "category1_5", "E3_570"),
    ## Παροχή Υπηρεσιών Τρίτων Χωρών
    ("2.3", "category1_3", "E3_561_006"),
    ("2.3", "category1_3", "E3_561_007"),
    ("2.3", "category1_3", "E3_563"),
    #
    ("2.3", "category1_5", "E3_561_006"),
    ("2.3", "category1_5", "E3_561_007"),
    ("2.3", "category1_5", "E3_562"),
    ("2.3", "category1_5", "E3_570"),
    ### Τίτλος Κτήσης
    ## Άρνηση έκδοσης από υπόχρεο Εκδότη
    ("3.2", "category1_1", "E3_561_001"),
    ("3.2", "category1_1", "E3_561_002"),
    ("3.2", "category1_1", "E3_561_007"),
    #
    ("3.2", "category1_2", "E3_561_001"),
    ("3.2", "category1_2", "E3_561_002"),
    ("3.2", "category1_2", "E3_561_007"),
    #
    ("3.2", "category1_3", "E3_561_001"),
    ("3.2", "category1_3", "E3_561_007"),
    ("3.2", "category1_3", "E3_563"),
    #
    ("3.2", "category1_4", "E3_880_001"),
    #
    ("3.2", "category1_5", "E3_561_007"),
    ("3.2", "category1_5", "E3_562"),
    ("3.2", "category1_5", "E3_563"),
    ("3.2", "category1_5", "E3_564"),
    ("3.2", "category1_5", "E3_565"),
    ("3.2", "category1_5", "E3_566"),
    ("3.2", "category1_5", "E3_567"),
    ("3.2", "category1_5", "E3_568"),
    ("3.2", "category1_5", "E3_570"),
    #
    ("3.2", "category1_95", "E3_596"),
    ("3.2", "category1_95", "E3_597"),
    # ("3.2", "category1_95", ""),
    ### Πιστωτικό Τιμολόγιο
    ## Μη συσχετιζόμενο
    ("5.2", "category1_1", "E3_561_001"),
    ("5.2", "category1_1", "E3_561_002"),
    ("5.2", "category1_1", "E3_561_005"),
    ("5.2", "category1_1", "E3_561_006"),
    ("5.2", "category1_1", "E3_561_007"),
    #
    ("5.2", "category1_2", "E3_561_001"),
    ("5.2", "category1_2", "E3_561_002"),
    ("5.2", "category1_2", "E3_561_005"),
    ("5.2", "category1_2", "E3_561_006"),
    ("5.2", "category1_2", "E3_561_007"),
    #
    ("5.2", "category1_3", "E3_561_001"),
    ("5.2", "category1_3", "E3_561_002"),
    ("5.2", "category1_3", "E3_561_005"),
    ("5.2", "category1_3", "E3_561_006"),
    ("5.2", "category1_3", "E3_561_007"),
    ("5.2", "category1_3", "E3_563"),
    #
    ("5.2", "category1_4", "E3_880_001"),
    ("5.2", "category1_4", "E3_880_003"),
    ("5.2", "category1_4", "E3_880_004"),
    #
    ("5.2", "category1_5", "E3_561_005"),
    ("5.2", "category1_5", "E3_561_006"),
    ("5.2", "category1_5", "E3_561_007"),
    ("5.2", "category1_5", "E3_562"),
    ("5.2", "category1_5", "E3_563"),
    ("5.2", "category1_5", "E3_564"),
    ("5.2", "category1_5", "E3_565"),
    ("5.2", "category1_5", "E3_566"),
    ("5.2", "category1_5", "E3_567"),
    ("5.2", "category1_5", "E3_568"),
    ("5.2", "category1_5", "E3_570"),
    ("5.2", "category1_5", "E3_561_002"),
    #
    ("5.2", "category1_7", "E3_881_001"),
    ("5.2", "category1_7", "E3_881_003"),
    ("5.2", "category1_7", "E3_881_004"),
    #
    ("5.2", "category1_95", "E3_596"),
    ("5.2", "category1_95", "E3_597"),
    # ("5.2", "category1_95", ""),
    ### Στοιχείο αυτοπαράδοσης
    ("6.1", "category1_6", "Ε3_595"),
    ## Στοιχείο ιδιοχρησιμοποίησης
    ("6.2", "category1_6", "Ε3_595"),
    ### Συμβόλαιο -Έσοδο
    ("7.1", "category1_1", "E3_561_001"),
    ("7.1", "category1_1", "E3_561_002"),
    ("7.1", "category1_1", "E3_561_007"),
    #
    ("7.1", "category1_2", "E3_561_001"),
    ("7.1", "category1_2", "E3_561_002"),
    ("7.1", "category1_2", "E3_561_007"),
    #
    ("7.1", "category1_3", "E3_561_001"),
    ("7.1", "category1_3", "E3_561_007"),
    #
    ("7.1", "category1_4", "E3_880_001"),
    #
    ("7.1", "category1_8", "E3_561_007"),
    ("7.1", "category1_8", "E3_562"),
    ("7.1", "category1_8", "E3_563"),
    ("7.1", "category1_8", "E3_570"),
    ### Ενοίκια Έσοδο
    ("8.1", "category1_3", "E3_561_001"),
    #
    ("8.1", "category1_5", "E3_562"),
    ### ΑΛΠ (Απόδειξη λιανικής πώλησης)
    ("11.1", "category1_1", "E3_561_003"),
    ("11.1", "category1_1", "E3_561_004"),
    ("11.1", "category1_1", "E3_561_005"),
    ("11.1", "category1_1", "E3_561_006"),
    ("11.1", "category1_1", "E3_561_007"),
    #
    ("11.1", "category1_2", "E3_561_003"),
    ("11.1", "category1_2", "E3_561_004"),
    ("11.1", "category1_2", "E3_561_005"),
    ("11.1", "category1_2", "E3_561_006"),
    ("11.1", "category1_2", "E3_561_007"),
    #
    ("11.1", "category1_3", "E3_561_003"),
    ("11.1", "category1_3", "E3_561_004"),
    ("11.1", "category1_3", "E3_561_005"),
    ("11.1", "category1_3", "E3_561_006"),
    ("11.1", "category1_3", "E3_561_007"),
    ("11.1", "category1_3", "E3_563"),
    #
    ("11.1", "category1_4", "E3_880_002"),
    ("11.1", "category1_4", "E3_880_003"),
    ("11.1", "category1_4", "E3_880_004"),
    ("11.1", "category1_4", "E3_561_007"),
    #
    ("11.1", "category1_5", "E3_561_007"),
    ("11.1", "category1_5", "E3_562"),
    ("11.1", "category1_5", "E3_563"),
    ("11.1", "category1_5", "E3_570"),
    #
    ("11.1", "category1_7", "E3_881_002"),
    ("11.1", "category1_7", "E3_881_003"),
    ("11.1", "category1_7", "E3_881_004"),
    ## ΑΠΥ Απόδειξη παροχής υπηρεσιών
    ("11.2", "category1_3", "E3_561_003"),
    ("11.2", "category1_3", "E3_561_005"),
    ("11.2", "category1_3", "E3_561_006"),
    ("11.2", "category1_3", "E3_561_007"),
    ("11.2", "category1_3", "E3_563"),
    #
    ("11.2", "category1_5", "E3_561_007"),
    ("11.2", "category1_5", "E3_562"),
    ("11.2", "category1_5", "E3_563"),
    ("11.2", "category1_5", "E3_570"),
    ## Απλοποιημένο τιμολόγιο
    ("11.3", "category1_1", "E3_561_001"),
    ("11.3", "category1_1", "E3_561_002"),
    ("11.3", "category1_1", "E3_561_003"),
    ("11.3", "category1_1", "E3_561_004"),
    ("11.3", "category1_1", "E3_561_005"),
    ("11.3", "category1_1", "E3_561_006"),
    ("11.3", "category1_1", "E3_561_007"),
    #
    ("11.3", "category1_2", "E3_561_001"),
    ("11.3", "category1_2", "E3_561_002"),
    ("11.3", "category1_2", "E3_561_003"),
    ("11.3", "category1_2", "E3_561_004"),
    ("11.3", "category1_2", "E3_561_005"),
    ("11.3", "category1_2", "E3_561_006"),
    ("11.3", "category1_2", "E3_561_007"),
    #
    ("11.3", "category1_3", "E3_561_001"),
    ("11.3", "category1_3", "E3_561_002"),
    ("11.3", "category1_3", "E3_561_003"),
    ("11.3", "category1_3", "E3_561_004"),
    ("11.3", "category1_3", "E3_561_005"),
    ("11.3", "category1_3", "E3_561_006"),
    ("11.3", "category1_3", "E3_561_007"),
    ("11.3", "category1_3", "E3_563"),
    #
    ("11.3", "category1_4", "E3_880_002"),
    ("11.3", "category1_4", "E3_880_003"),
    ("11.3", "category1_4", "E3_880_004"),
    ("11.3", "category1_4", "E3_561_007"),
    #
    ("11.3", "category1_5", "E3_561_007"),
    ("11.3", "category1_5", "E3_562"),
    ("11.3", "category1_5", "E3_563"),
    ("11.3", "category1_5", "E3_570"),
    #
    ("11.3", "category1_7", "E3_881_002"),
    ("11.3", "category1_7", "E3_881_003"),
    ("11.3", "category1_7", "E3_881_004"),
    ## Πιστωτικό στοιχείο λιανικής
    ("11.4", "category1_1", "E3_561_001"),
    ("11.4", "category1_1", "E3_561_002"),
    ("11.4", "category1_1", "E3_561_003"),
    ("11.4", "category1_1", "E3_561_004"),
    ("11.4", "category1_1", "E3_561_005"),
    ("11.4", "category1_1", "E3_561_006"),
    ("11.4", "category1_1", "E3_561_007"),
    #
    ("11.4", "category1_2", "E3_561_001"),
    ("11.4", "category1_2", "E3_561_002"),
    ("11.4", "category1_2", "E3_561_003"),
    ("11.4", "category1_2", "E3_561_004"),
    ("11.4", "category1_2", "E3_561_005"),
    ("11.4", "category1_2", "E3_561_006"),
    ("11.4", "category1_2", "E3_561_007"),
    #
    ("11.4", "category1_3", "E3_561_001"),
    ("11.4", "category1_3", "E3_561_002"),
    ("11.4", "category1_3", "E3_561_003"),
    ("11.4", "category1_3", "E3_561_004"),
    ("11.4", "category1_3", "E3_561_005"),
    ("11.4", "category1_3", "E3_561_006"),
    ("11.4", "category1_3", "E3_561_007"),
    ("11.4", "category1_3", "E3_563"),
    #
    ("11.4", "category1_4", "E3_880_002"),
    ("11.4", "category1_4", "E3_880_003"),
    ("11.4", "category1_4", "E3_880_004"),
    ("11.4", "category1_4", "E3_561_007"),
    #
    ("11.4", "category1_5", "E3_561_007"),
    ("11.4", "category1_5", "E3_562"),
    ("11.4", "category1_5", "E3_563"),
    ("11.4", "category1_5", "E3_570"),
    #
    ("11.4", "category1_7", "E3_881_002"),
    ("11.4", "category1_7", "E3_881_003"),
    ("11.4", "category1_7", "E3_881_004"),
    ## Λιανική Πώληση για λογαριασμό τρίτων
    ("11.5", "category1_7", "E3_881_002"),
    ("11.5", "category1_7", "E3_881_003"),
    ("11.5", "category1_7", "E3_881_004"),
    ### Λοιπές Εγγραφές Τακτοποίησης Εσόδων - Λογιστική Βάση
    ("17.3", "category1_10", "E3_561_001"),
    ("17.3", "category1_10", "E3_561_002"),
    ("17.3", "category1_10", "E3_561_003"),
    ("17.3", "category1_10", "E3_561_004"),
    ("17.3", "category1_10", "E3_561_005"),
    ("17.3", "category1_10", "E3_561_006"),
    ("17.3", "category1_10", "E3_561_007"),
    ("17.3", "category1_10", "E3_562"),
    ("17.3", "category1_10", "E3_563"),
    ("17.3", "category1_10", "E3_595"),
    ("17.3", "category1_10", "E3_596"),
    ("17.3", "category1_10", "E3_597"),
    ("17.3", "category1_10", "E3_880_001"),
    ("17.3", "category1_10", "E3_880_002"),
    ("17.3", "category1_10", "E3_880_003"),
    ("17.3", "category1_10", "E3_880_004"),
    ("17.3", "category1_10", "E3_881_001"),
    ("17.3", "category1_10", "E3_881_002"),
    ("17.3", "category1_10", "E3_881_003"),
    ("17.3", "category1_10", "E3_881_004"),
    ("17.3", "category1_10", "E3_564"),
    ("17.3", "category1_10", "E3_565"),
    ("17.3", "category1_10", "E3_566"),
    ("17.3", "category1_10", "E3_567"),
    ("17.3", "category1_10", "E3_568"),
    ("17.3", "category1_10", "E3_570"),
)


def category_frompartype(partyp: str):
    dcat = {i: j for i, j in icat}
    list_cat = []
    for typ, cat, _ in typ_cat_e3:
        if typ == partyp:
            list_cat.append((cat, dcat[cat]))
    unique_cat = list(set(list_cat))
    unique_cat.sort(key=lambda x: x[0])
    return unique_cat


def e3_from_partyp_category(partyp: str, category: str):
    de3 = {i: j for i, j in ie3}
    list_e3 = []
    for typ, cat, e_3 in typ_cat_e3:
        if typ == partyp and cat == category:
            list_e3.append((e_3, de3[e_3]))
    return list_e3


# def category_e3_from_partype(key: str):
#     dcat = {i: j for i, j in icat}
#     de3 = {i: j for i, j in ie3}
#     list_cat = []
#     list_e3 = []
#     for typ, cat, e_3 in typ_cat_e3:
#         if typ == key:
#             list_cat.append((cat, dcat[cat]))
#             list_e3.append((cat, e_3, de3[e_3]))
#     unique_cat = list(set(list_cat))
#     unique_cat.sort(key=lambda x: x[0])
#     return unique_cat, list_e3


if __name__ == "__main__":
    pt = "1.1"
    cat = category_frompartype(pt)
    print(cat[6])
    print(e3_from_partyp_category(pt, cat[6][0]))
